/*
 * libevent代码目录结构:
 * */
//////////////////////////////////////////////////////////////////////////////////
/*
.
├──-----------------------------------------------------------------------------
├── event.h			//事件宏定义、接口函数声明，主要结构体event的声明;
├── event.c			//event整体框架的代码实现;
├──-----------------------------------------------------------------------------
├── event-internal.h
├── evrpc-internal.h
├── http-internal.h
├── strlcpy-internal.h
├──-----------------------------------------------------------------------------
├── epoll.c			//对epoll的封装
├── poll.c			//对poll的封装
├── devpoll.c		//对dev/poll的封装;
├── select.c		//对select的封装
├── kqueue.c		//对kqueue的封装
├──-----------------------------------------------------------------------------
├── min_heap.h		//一个以时间作为key的小根堆结构
├──-----------------------------------------------------------------------------
├── signal.c		//对信号事件的处理
├──-----------------------------------------------------------------------------
├── evutil.c		//一些辅助功能函数，包括创建socket pair和一些时间操作函数：加、减和比较等。
├── evutil.h		//一些辅助功能函数，包括创建socket pair和一些时间操作函数：加、减和比较等。
├──-----------------------------------------------------------------------------
├── log.c			//log日志函数
├── log.h			//log日志函数
├──-----------------------------------------------------------------------------
├── evbuffer.c		//ibevent对缓冲区的封装
├── buffer.c		//ibevent对缓冲区的封装
├──-----------------------------------------------------------------------------
├── evdns.c			//是基于libevent实现的异步dns查询库
├── evdns.h			//是基于libevent实现的异步dns查询库
├──-----------------------------------------------------------------------------
├── evport.c		//是基于libevent实现的http服务器
├──-----------------------------------------------------------------------------
├── epoll_sub.c
├── event-config.h
├── event_tagging.c
├── evhttp.h
├── evrpc.c
├── evrpc.h
├── evsignal.h
├── http.c
├── libtool
├── missing
├── strlcpy.c
├──-----------------------------------------------------------------------------
├── compat
│   └── sys
│       ├── _libevent_time.h	//基本数据结构的实现，一些用于时间操作的结构体定义、函数和宏定义;
│       └── queue.h				//基本数据结构的实现，包括链表，双向链表，队列等
├──-----------------------------------------------------------------------------
├── doc
│   └── libevent源码剖析.pdf
├──-----------------------------------------------------------------------------
├── sample
│   ├── event-test.c
│   ├── Makefile
│   ├── Makefile.am
│   ├── Makefile.in
│   ├── signal-test.c
│   └── time-test.c
├──-----------------------------------------------------------------------------
├── test
│   ├── bench.c
│   ├── Makefile
│   ├── Makefile.am
│   ├── Makefile.in
│   ├── regress.c
│   ├── regress_dns.c
│   ├── regress.gen.c
│   ├── regress.gen.h
│   ├── regress.h
│   ├── regress_http.c
│   ├── regress.rpc
│   ├── regress_rpc.c
│   ├── test-eof.c
│   ├── test-init.c
│   ├── test.sh
│   ├── test-time.c
│   └── test-weof.c
├──-----------------------------------------------------------------------------
├── WIN32-Code
│   ├── config.h
│   ├── event-config.h
│   ├── tree.h
│   └── win32.c
└── WIN32-Prj
    ├── event_test
    │   ├── event_test.dsp
    │   └── test.txt
    ├── libevent.dsp
    ├── libevent.dsw
    ├── libevent.sln
    ├── libevent.vcproj
    ├── regress
    │   └── regress.vcproj
    ├── signal_test
    │   └── signal_test.dsp
    └── time_test
        └── time_test.dsp

*/
